# Работа с данными в Pandas

### Задание 1

In [2]:
import pandas as pd

In [16]:
import numpy as np

In [3]:
authors = pd.DataFrame({'author_id': [1, 2, 3],
                       'author_name': ['Тургенев', 'Чехов', 'Островский']}, 
                       columns = ['author_id', 'author_name']).set_index('author_id')

In [4]:
authors

          author_name
author_id
1            Тургенев
2               Чехов
3          Островский

In [5]:
book = pd.DataFrame({'author_id': [1, 1, 1, 2, 2, 3, 3],
                    'book_title': ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 
                                   'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 
                                   'Таланты и поклонники'],
                    'price': [450, 300, 350, 500, 450, 370, 290]},
                   columns = ['author_id', 'book_title', 'price']).set_index('author_id')

In [6]:
book

                     book_title  price
author_id
1                   Отцы и дети    450
1                         Рудин    300
1             Дворянское гнездо    350
2              Толстый и тонкий    500
2               Дама с собачкой    450
3                         Гроза    370
3          Таланты и поклонники    290

### Задание 2

In [7]:
authors_price = pd.merge(authors, book, on = 'author_id', how = 'inner')
authors_price

          author_name            book_title  price
author_id
1            Тургенев           Отцы и дети    450
1            Тургенев                 Рудин    300
1            Тургенев     Дворянское гнездо    350
2               Чехов      Толстый и тонкий    500
2               Чехов       Дама с собачкой    450
3          Островский                 Гроза    370
3          Островский  Таланты и поклонники    290

### Задание 3

In [8]:
top5 = authors_price.nlargest(5, 'price')

In [9]:
top5

          author_name         book_title  price
author_id
2               Чехов   Толстый и тонкий    500
1            Тургенев        Отцы и дети    450
2               Чехов    Дама с собачкой    450
3          Островский              Гроза    370
1            Тургенев  Дворянское гнездо    350

### Задание 4

In [10]:
min_price = authors_price.groupby('author_name')['price'].min()
max_price = authors_price.groupby('author_name')['price'].max()
mean_price = authors_price.groupby('author_name')['price'].mean()

In [11]:
authors_stat = pd.merge(pd.merge(min_price, max_price, on='author_name'), mean_price, on='author_name')
authors_stat = authors_stat.rename(columns={'price_x': 'min_price', 
                                            'price_y': 'max_price', 
                                            'price': 'mean_price'}).sort_values(by='max_price', 
                                                                                ascending=False)

authors_stat

             min_price  max_price  mean_price
author_name
Чехов              450        500  475.000000
Тургенев           300        450  366.666667
Островский         290        370  330.000000

### Задание 5

In [12]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [13]:
authors_price

          author_name            book_title  price    cover
author_id
1            Тургенев           Отцы и дети    450  твердая
1            Тургенев                 Рудин    300   мягкая
1            Тургенев     Дворянское гнездо    350   мягкая
2               Чехов      Толстый и тонкий    500  твердая
2               Чехов       Дама с собачкой    450  твердая
3          Островский                 Гроза    370   мягкая
3          Островский  Таланты и поклонники    290   мягкая

In [21]:
book_info = pd.pivot_table(authors_price, values='price', index='author_name',
                          columns='cover', aggfunc = np.sum)
                            .fillna(0)
                            .astype("Int64")

In [27]:
book_info.to_pickle('book_info.pkl')

In [28]:
book_info2 = pd.read_pickle('book_info.pkl')

In [29]:
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [30]:
book_info2

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950